В Python есть три числовых типа:

int
float
complex

Переменные числового типа создаются, когда вы присваиваете им значение:

1.Int или целое число - это целое число неограниченной длины, положительное или отрицательное, без десятичных знаков.

2.Float - Число с плавающей запятой или «число с плавающей запятой» -
 это положительное или отрицательное число, содержащее один или несколько десятичных знаков.

3.Complex - Сложный - Комплексные числа записываются с мнимой частью "j"

4.Преобразование типов:
Вы можете конвертировать из одного типа в другой с int(), float()и complex()


5.Случайный номер (Random)
В Python нет random() функции для создания случайных чисел, но в Python есть встроенный модуль,
 random который можно использовать для создания случайных чисел:
пример:
Импортируйте случайный модуль и отобразите случайное число от 1 до 9:
import random
print(random.randrange(1, 10))






#+
print(2 + 3)
# -
print(10 - 3)

# /
print(6+3)

# *
print(2*3)

# %
print(20 % 3)

# //
print(20 // 3)

# **
print(20 ** 3)





СПИСОК ВНУТРИ СПИСКА
